# Parameters
task: detect
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
  m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
  l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
  x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [4, 1, Conv, [256, 1, 1]]                # 10 
  - [6, 1, Conv, [256, 1, 1]]                # 11 
  - [9, 1, Conv, [256, 1, 1]]                # 12 

  - [12, 1, nn.Upsample, [None, 2, nearest]]  # 13 
  - [[11, 13], 1, WeightedAdd, [2]]           # 14  
  - [-1, 1, DWConv, [256, 3, 1]]              # 15 

  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 16 
  - [[10, 16], 1, WeightedAdd, [2]]           # 17 
  - [-1, 1, DWConv, [256, 3, 1]]              # 18 


  - [18, 1, Conv, [256, 3, 2]]                # 19 
  - [[11, 15, 19], 1, WeightedAdd, [3]]       # 20 
  - [-1, 1, DWConv, [256, 3, 1]]              # 21 

  - [21, 1, Conv, [256, 3, 2]]                # 22 
  - [[12, 22], 1, WeightedAdd, [2]]           # 23 
  - [-1, 1, DWConv, [256, 3, 1]]              # 24 

  - [[18, 21, 24], 1, Detect, [nc]]